/************************************************************************
 *File: vh.trans.c 
 *Purpose: расчёт согласующего трансформатора из коаксиального кабеля 1/4 длинны волны, для 
 кабелей RG-58 , PK-75-4-11
 *Notica: V1.1
 ************************************************************************
 */
#include<stdio.h>
#include<math.h>
const float K_u1=0.66; // коэфициент укарачивания кабеля RG-58.
const float K_u2=0.52; // коэфициент укарачивания кабеля РК-75-4-11

int main(){
float Rf, Ra, F;
float L, z, l;// L-длинна короткозамкнутого отрезка
printf("расчёт вч-трансформатора т из кооксиального кабеля 1/4*Lволны \n");
printf("введите частоту МГц : \n");
scanf("%f",& F);
printf("введите сопротивление антенны ом : \n");
scanf("%f",& Ra);
printf("введите сопротивление фидера 50 или 75 ом : \n");
scanf("%f",& Rf);
if(Rf=50){
	l=((300000/(F*1000))/4)*K_u1;
	if(Ra<Rf){
		z= sqrt(Ra/Rf);
		L=(150*K_u1*(asin(z)))/(3.14*F);
	}
	else if(Ra>Rf){
		z= sqrt(Rf/Ra);
		L=(150*K_u1*(asin(z)))/(3.14*F);
	}
}
else if(Rf=75){
	l=((300000/(F*1000))/4)*K_u2;
	if(Ra<Rf){
		z= sqrt(Ra/Rf);
		L=(150*K_u2*(asin(z)))/(3.14*F);
	}
	else if(Ra>Rf){
		z= sqrt(Rf/Ra);
		L=(150*K_u2*(asin(z)))/(3.14*F);
	}
	}
printf("длинна 1/4 кабеля = %f \n",l);
printf("длинна трансформатора = %f \n",L);

return 0;
}
